
## Plan Result




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.hmc_to_et_hearings_api_s2s_secret
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc_to_et_hearings_api_s2s_secret will be created
  + resource "azurerm_key_vault_secret" "hmc_to_et_hearings_api_s2s_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"
      + name                    = "hmc-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "et-hearings-api-aat"
      + target_resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-subs-to-cft-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":53,"Program":"tfcmt","SHA1":"","Vars":{}} -->